Revit 2027 API
DockablePanes.BuiltInDockablePanes.SharedViews Property
 The shared view pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DockablePaneId SharedViews { get; }
Public Shared ReadOnly Property SharedViews As DockablePaneId
	Get
public:
static property DockablePaneId^ SharedViews {
	DockablePaneId^ get ();
}
static member SharedViews : DockablePaneId with get
Property Value
DockablePaneId
See Also
Reference
DockablePanes.BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace